// /Мінімум

// Запитай у користувача його вік і визначи, ким він є: дитиною (0-2), підлітком (12-18), дорослим (18_60) або пенсіонером (60 ...), 
// передбач можливість введення невірних даних.

// ------------------task1-----------------
// let age = prompt('Скільки вам років?');
// if (age >= 0 && age <= 2) {
//     console.log('Дитина');
// }
// else if (age >= 12 && age <= 18) {
//     console.log('Підліток');
// }
// else if (age >= 18 && age <= 60) {
//     console.log('Дорослий');
// }
// else if (age > 60) {
//     console.log('Пенсіонер');
// }
// else { 
//     console.log('Введене невірне значення'); 
// }
// Запитай у користувача число від 0 до 9 і виведи йому спецсимвол, який розташований на цій клавіші (1 !, 2 @, 3 # і т. д).
// -----------------------task2----------------
// let number = prompt('Введіть число від 0 до 9');
// switch(number) {
//     case '0':
//         alert('0 is )');
//         break;
//     case '1':
//         alert('1 is !');
//         break;
//     case '2':
//         alert('2 is @');
//         break;
//     case '3':
//         alert('3 is #');
//         break;
//     case '4':
//         alert('4 is $');
//         break;
//     case '5':
//         alert('5 is %');
//         break;
//     case '6':
//         alert('6 is ^');
//         break;
//     case '7':
//         alert('7 is &');
//         break;
//     case '8':
//         alert('8 is *');
//         break;
//     case '9':
//         alert('9 is (');
//         break;}

// Підрахуй суму всіх чисел в заданому користувачем діапазоні.
//  -------------------task3-------------------
// // let a = Number(prompt("введіть початок діапазону",""));
// // let n = Number(prompt("введіть кінець діапазону",""));
// // let sum = 0;
// // while (a<=n) {
//     sum += a;
//     a++;
// }
// alert(sum)

// Запитай у користувача 2 числа і знайди найбільший спільний дільник.
// -------------------task4-------------------
// let a = Number(prompt("введіть перше число", ""));
// let n = Number(prompt("введіть друге число", ""));
// for (let i = a; i <= a; i--) {
//     if (a % i == 0 && n % i == 0) {
//         alert(`${i}`);
//         break;
//     }
// } 
// Запитай у користувача число і виведи всі дільники цього числа.
// -------------------task5-------------------
// let n = Number(prompt("введіть число", ""));
// for (let i = n; i <= n; i++) {
//     if (n%i== 0 ) {
//         alert(`${i}`);
//         break;
//     }
// }
// Норма

// Запитай у користувача п’ятирозрядне число і визначи, чи є воно паліндромом.
// -------------------task6-------------------
// let num = prompt("Введіть пятизначне число");
// const num1 = 12321; // Output: true
// const num2 = -121; // Output: false
// const num3 = 10; // Output: false

// const isPalindromeNumber = function (x) {
//     if (x < 0) return false;
//     if (x < 10) return true;
//     if (x % 10 === 0) return false;

//     let rev = 0;

//     while (x > rev) {
//         console.log(x, rev);
//         rev *= 10;
//         rev += x % 10;
//         x = Math.trunc(x / 10);
//     }

//     console.log(x, rev);

//     return x === rev || x === Math.trunc(rev / 10);
// };

// console.log(isPalindromeNumber(num));


// Запитай у користувача суму покупки і виведи суму до оплати зі знижкою:
// від 200 до 300 - знижка буде 3%;
// від 300 до 500 - 5%;
// від 500 і вище - 7%.
// -------------------task7-----------------------
// let summ = prompt('Сума покупки?');
// if (summ >= 200 && summ <= 300) {
//     alert(summ*0.97 + '$ Сума до оплати з 3% знижки');
// }
// else if (summ >= 300 && summ <= 500) {
//     alert(summ*0.95 + '$ Сума до оплати з 5% знижки');
// }
// else if ( summ > 500) {
//     alert(summ*0.93 + '$ Сума до оплати з 7% знижки');
// }

// Запитай у користувача 10 чисел і порахуй, скільки він ввів додатніх, від’ємних і нулів.
//  При цьому також порахуй, скільки з них парних і непарних. Виведи статистику на екран.
//  Враховуй, що достатньо однієї змінної (не 10) для введення чисел користувачем.
// -------------------task8-------------------
// let count = 0;
// let arr = new Array();
// for (let i = 0; i <= 9; i++){
//     arr.push(prompt('Enter your number'));
//     if (arr[i] >= 0){
//         count++;
//     }
//     if (isNaN(arr[i])){
//         alert('Error');
//         break;
//     }
// }
// alert(`You have entered ${count} numbers that is positive`);


// Зацикли висновок днів тижня таким чином: «День тижня. Хочеш побачити наступний день? » і так до тих пір, поки користувач натискає OK.
// -------------------task9-------------------
// const days = ['Понеділок', 'Вівторок', 'Середа', 'Четвер', 'Пятниця', 'Субота', 'Неділя'];
// let currDay = 0;

// while (confirm(`${days[currDay]}. Хочеш побачити наступний день?`)) {
//     currDay = (currDay + 1) % days.length;
// }
// Максимум

// Гра «Вгадай число». Запропонуй користувачеві загадати число від 0 до 100 і відгадай його наступним способом:
// кожну ітерацію циклу діли діапазон чисел навпіл, записуй результат в N і питай у користувача «Ваше число> N, <N або == N?».
// Залежно від того що вказав користувач, зменшуй діапазон.
// Початковий діапазон від 0 до 100, поділи навпіл і отримай 50.
// Якщо користувач вказав, що його число> 50, то зміни діапазон на від 51 до 100. І так до тих пір, поки користувач не вибере == N.
// const n = 0;
// const m =100;
// let start = n;
// let end = m;
// while (true){ 
//     let num = Math.floor((start + end) / 2);
//     let answr = prompt(num + ' Is it your number ? - y (yes), - b (biger), -  l (lower)');
//     if (answr == 'y'){
//         alert('I guess, cool!!!');
//         break;
//     } 
//     if (answr == 'l'){
//         end = num - 1;
//     } 
//     if (answr == 'b'){
//         start = num + 1;
//     }
// }

// Виведи таблицю множення для всіх чисел від 2 до 9. Кожне число необхідно помножити на числа від 1 до 10.
// Запитай дату (день, місяць, рік) і виведи наступну за нею дату. Враховуй можливість переходу на наступний місяць, рік, а також високосний рік./



// Определить количество цифр в введенном числе.
// -------------------task4-------------------
// let n = Number(prompt("введіть число", ""));
//     for(let i = 0; n > 1; i++) {
//        n /= 10;
//        console.log(`${i}`);
//     }

// Зациклить калькулятор. Запросить у пользователя 2 числа и знак, решить пример, 
//    вывести результат и спросить, хочет ли он решить еще один пример. И так до тех пор, пока пользователь не откажется.
// -------------------task6-------------------
// while (true) {
//     const a = +prompt('Введіть 1 число');
//     const b = +prompt('Введіть 2 число');
//     const op = prompt('Виберіть знак - + / *');
//     const action = {
//         '+': () => a + b,
//         '-': () => a - b,
//         '/': () => a / b,
//         '*': () => a * b
//     }[op];
//     if (action) alert(action());
//     if (!confirm('Чи хочете ви розвязати ще один приклад?')) break;
// }
// Запросить у пользователя число и на сколько цифр его сдвинуть. 
//    Сдвинуть цифры числа и вывести результат (если число 123456 сдвинуть на 2 цифры, то получится 345612).
// -------------------task7-------------------
// const num = prompt('Enter a number', 0);
// const sliceNum = prompt('Enter a shift number',0);
// if(isNaN(num) || isNaN(sliceNum)){
//     alert('Error');
// } else {
//     alert(`Result number is ${num.slice(sliceNum) + num.slice(0, sliceNum)}`);
// }


