// -------------------task1-------------------
// let a = Number(prompt("введіть початок діапазону",""));
// let n = Number(prompt("введіть кінець діапазону",""));
// let sum = 0;

// while (a<=n) {
//     sum += a;
//     a++;
// }
// alert(sum)


// -------------------task2-------------------
// let a = Number(prompt("введіть перше число", ""));
// let n = Number(prompt("введіть друге число", ""));
// for (let i = a; i <= a; i--) {
//     if (a % i == 0 && n % i == 0) {
//         alert(`${i}`);
//         break;
//     }
// }
// -------------------task3-------------------
// let n = Number(prompt("введіть число", ""));
// for (let i = n; i <= n; i++) {
//     if (n%i== 0 ) {
//         alert(`${i}`);
//         break;
//     }
// }
// -------------------task4-------------------
// let n = Number(prompt("введіть число", ""));
//     for(let i = 0; n > 1; i++) {
//        n /= 10;
//        console.log(`${i}`);
//     }
// -------------------task5-------------------
// let Q1 = 0, Q2 = 0;
// let N = prompt("введите 10 чисел: ",);
// if (N) {
//     N.split(" ").map(function (s) {
//         var num = parseInt(s);
//         if (num !== NaN) {
//             if (num > 0 && num != 0) { Q1++; }
//             else { Q2++; }
//         }
//     });
// }
// if (Q1 > 0) {
//     alert("Количество положительных: " + Q1);
// }
// else {
//     alert("Положительных чисел нет");
// }

// if (Q1 > 0) {
//     alert("Количество отрицательных: " + Q2);
// }
// else {
//     alert("Отрицательных чисел нет");
// }

// -------------------task6-------------------
// while (true) {
//     const a = +prompt('Введіть 1 число');
//     const b = +prompt('Введіть 2 число');
//     const op = prompt('Виберіть знак - + / *');
//     const action = {
//         '+': () => a + b,
//         '-': () => a - b,
//         '/': () => a / b,
//         '*': () => a * b
//     }[op];
//     if (action) alert(action());
//     if (!confirm('Чи хочете ви розвязати ще один приклад?')) break;
// }

// -------------------task8-------------------
// const days = ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье'];
// let currDay = 0;

// while (confirm(`${days[currDay]}. Хотите увидеть следующий день?`)) {
//     currDay = (currDay + 1) % days.length;
// }
// -------------------task9-------------------